#lang racket

(define (a-plus-abs-b a b)
  ((if (> b 0) + -) a b))
;По правилу вычисления комбинации, определенному в 1.1.3,
;сначала необходимо вычислить значение всех подвыражений.
;Для того, чтобы вычислить значение оператора комбинации
;в теле функции, нам нужно получить значение предиката
;(> b 0). Если вернется значение "true", то оператором  
;комбинации будет "+", в противном случае оператором 
;будет "-". Таким образом, комбинация, определенная в теле
;функции, будет редуцирована до (+ a b) или (- a b).